about =  """
        *Бомдод намози*
        Субҳи содиқдан (чин тонг отгандан) кун чиққунчадир.
        Бомдод намозини тонг ёришганда ўқиш мустаҳаб,
        аълороқдир. Соат бўйича ҳисобланса, 
        бомдодни кун чиқишидан 40 дақиқача илгари ўқиш 
        мустаҳаб вақтига мувофиқ бўлади.
        
*Пешин намози*
        Қуёш заволга (оғишга) кетганидан сўнг то нарсаларнинг
        сояси қуёш тиккага келган пайтдаги со-ясидан ташқари 
        ўз узунлигига нисбатан икки баравар ортгунига қадар.
        Пешин намозини ёз фаслида бироз кечиктириб, қиш 
        фаслида эса вақти кириши билан ўқиш мустаҳабдир.

*Аср намози*
        Ҳар бир нарсанинг сояси қуёш тиккага келган пайтдаги 
        соясидан ташқари ўзига нисбатан икки баравар ортганидан 
        бошлаб қуёш ботгунчадир.
        Аср намозини қуёш тиғини ўзгартирмай, нурсиз ҳолатга 
        кири-шидан олдинроқ ўқиш мустаҳабдир.
        
*Шом намози*
        Кун ботган пайтдан бошлаб кунботар томонда шафақ 
        (қизғиш нурлар) ғойиб бўлгунчадир.
        Шом намозини доимо қуёш ботиши билан ўқиш 
        мустаҳабдир.
        
*Хуфтон намози*
        Шафақ батамом йўқолгандан кейин киради.
        Хуфтон намозини кечанинг учдан бирининг охирида ўқиш 
        афзал ва ниҳоятда аъло бўлади.
        
*Витр намози*
        Хуфтон ўқилгандан кейингина киради. Хуфтон ва витр 
        намозларини субҳи содиққача ўқиса бўлади.
        Витр намозини тун охирида уйғонишга қодир бўлган 
        кишилар субҳ олдидан ўқисалар, мустаҳаб амал қилган 
        бўлишади.
        
        """


iftar = """
        Ифторлик (оғиз очиш) дуоси

*اَللَّهُمَّ لَكَ صُمْتُ وَ بِكَ آمَنْتُ وَ عَلَيْكَ تَوَكَّلْتُ وَ عَلَى رِزْقِكَ أَفْتَرْتُ، فَغْفِرْلِى مَا قَدَّمْتُ وَ مَا أَخَّرْتُ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِي*نَ

*Аллоҳумма лака сумту ва бика ааманту ва аълайка таваккалту ва аълаа ризқика афтарту, фағфирлий ма қоддамту ва маа аххорту бироҳматика йаа арҳамар рооҳимийн.*

_Маъноси: Эй Аллоҳ, ушбу Рўзамни Сен учун тутдим ва Сенга иймон келтирдим ва Сенга таваккал қилдим ва берган ризқинг билан ифтор қилдим. Эй меҳрибонларнинг энг меҳрибони, менинг аввалги ва кейинги гуноҳларимни мағфират қилгил._
        """


saxarlik = """
        Рўза тутиш (саҳарлик, оғиз ёпиш) дуоси

*نَوَيْتُ أَنْ أَصُومَ صَوْمَ شَهْرَ رَمَضَانَ مِنَ الْفَجْرِ إِلَى الْمَغْرِبِ، خَالِصًا لِلهِ تَعَالَى أَللهُ أَكْبَرُ*

*Навайту ан асувма совма шаҳри рамазона минал фажри илал мағриби, холисан лиллаҳи таъаалаа Аллоҳу акбар.*

_Маъноси: Рамазон ойининг рўзасини субҳдан то кун ботгунча тутмоқни ният қилдим. Холис Аллоҳ учун Аллоҳ буюкдир._
        """